const KeywordCategory= [
    {
        'key':'성별',
        'items': [
            '남', '여', '남L남', '여L여', 'MTF', 'FTM', '무관'
        ],
        // 남L남: 남자를 좋아하는 남자
        // 여l여: 여자를 좋아하는 여자
        // MTF: 여자가 된 남자 트랜스젠더
        // FTM: 남자가 된 여자 트랜스젠더
    }, 
    {
        'key':'기념일',
        'items':[
            '생일', '100일', '200일', 'N 주년', '결혼기념일',
            '취직', '졸업', '깜짝 이벤트', '이사', '창업', '이별',
            '출산', '여행'
        ],
    },
    {
        'key': '직업',
        'items': [
            '초등학생', '중학생', '고등학생', '대학생',
            '석사', '박사', '직장인', '갓수', '주부',
            '디자이너', '개발자', '연구원', 
        ]
    },
    {
        'key':'성격',
        'items': [
            '내성적', '소심', '조용함', '평범함', '활발함',
            '말괄량이', '주목받길 좋아함', '모험심이 강함',
            '호기심이 강함'
        ]
    },
    {
        'key':'취향',
        'items': [
            '귀여움', '여성적', '세련됨', 'IT광', '얼리어답터',
            '패션왕', '쥬얼리', '키덜트', '덕후', '아이돌', '남성적',
        ]
    },
    {
        'key':'취미',
        'items': [
            '운동', '독서', '영화', '드라마', '노래', '덕질',
            '악기', 'TV', '게임', '요리', 'DIY', '공부',
            '그림', '여행'
        ]
    }
];

export default KeywordCategory;